nxp-mcuxpresso/mcux-sdk/devices/MIMXRT555S/gcc/startup_MIMXRT555S.S
/* --------------------------------------------------------------------------*/
/* @file:    startup_MIMXRT555S.s                                                */
/* @purpose: CMSIS Cortex-M33 Core Device Startup File                       */
/*           MIMXRT555S                                                          */
/* @version: 5.0                                                      */
/* @date:    2020-8-27                                                         */
/* --------------------------------------------------------------------------*/
/*                                                                           */
/* Copyright 1997-2016 Freescale Semiconductor, Inc.                         */
/* Copyright 2016-2021 NXP                                                   */
/* All rights reserved.                                                      */
/*                                                                           */
/* SPDX-License-Identifier: BSD-3-Clause                                     */
/*****************************************************************************/
/* Version: GCC for ARM Embedded Processors                                  */
/*****************************************************************************/


    .syntax unified
    .arch armv8-m.main

    .section .isr_vector, "a"
    .align 2
    .globl __isr_vector
__isr_vector:
    .long   __StackTop                                      /* Top of Stack */
    .long   Reset_Handler                                   /* Reset Handler */
    .long   NMI_Handler                                     /* NMI Handler*/
    .long   HardFault_Handler                               /* Hard Fault Handler*/
    .long   MemManage_Handler                               /* MPU Fault Handler*/
    .long   BusFault_Handler                                /* Bus Fault Handler*/
    .long   UsageFault_Handler                              /* Usage Fault Handler*/
    .long   SecureFault_Handler                             /* Secure Fault Handler*/
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
    .long   0x280000                                        /* Image length*/
#else
    .long   _image_size                                     /* Image length*/
#endif
    .long   0                                               /* Reserved*/
    .long   0                                               /* Reserved*/
    .long   SVC_Handler                                     /* SVCall Handler*/
    .long   DebugMon_Handler                                /* Debug Monitor Handler*/
    .long   __isr_vector                                    /* Image load address*/
    .long   PendSV_Handler                                  /* PendSV Handler*/
    .long   SysTick_Handler                                 /* SysTick Handler*/

    /* External Interrupts */
    .long   WDT0_IRQHandler  /* Watchdog timer interrupt */
    .long   DMA0_IRQHandler  /* DMA interrupt */
    .long   GPIO_INTA_IRQHandler  /* GPIO Interrupt A */
    .long   GPIO_INTB_IRQHandler  /* GPIO Interrupt B */
    .long   PIN_INT0_IRQHandler  /* General Purpose Input/Output interrupt 0 */
    .long   PIN_INT1_IRQHandler  /* General Purpose Input/Output interrupt 1 */
    .long   PIN_INT2_IRQHandler  /* General Purpose Input/Output interrupt 2 */
    .long   PIN_INT3_IRQHandler  /* General Purpose Input/Output interrupt 3 */
    .long   UTICK0_IRQHandler  /* Micro-tick Timer */
    .long   MRT0_IRQHandler  /* Multi-Rate Timer */
    .long   CTIMER0_IRQHandler  /* Standard counter/timer CTIMER0 */
    .long   CTIMER1_IRQHandler  /* Standard counter/timer CTIMER1 */
    .long   SCT0_IRQHandler  /* SCTimer/PWM */
    .long   CTIMER3_IRQHandler  /* Standard counter/timer CTIMER3 */
    .long   FLEXCOMM0_IRQHandler  /* FlexComm interrupt */
    .long   FLEXCOMM1_IRQHandler  /* FlexComm interrupt */
    .long   FLEXCOMM2_IRQHandler  /* FlexComm interrupt */
    .long   FLEXCOMM3_IRQHandler  /* FlexComm interrupt */
    .long   FLEXCOMM4_IRQHandler  /* FlexComm interrupt */
    .long   FLEXCOMM5_IRQHandler  /* FlexComm interrupt */
    .long   FLEXCOMM14_IRQHandler  /* FlexComm interrupt. Standalone SPI */
    .long   FLEXCOMM15_IRQHandler  /* FlexComm interrupt. Standalone I2C */
    .long   ADC0_IRQHandler  /* Analog-to-Digital Converter interrupt */
    .long   Reserved39_IRQHandler  /* Reserved interrupt */
    .long   ACMP_IRQHandler  /* Analog comparator Interrupts */
    .long   DMIC0_IRQHandler  /* Digital Microphone Interface interrupt */
    .long   Reserved42_IRQHandler  /* Reserved interrupt */
    .long   HYPERVISOR_IRQHandler  /* Hypervisor interrupt */
    .long   SECURE_VIOLATION_IRQHandler  /* Secure violation interrupt */
    .long   HWVAD0_IRQHandler  /* Hardware Voice Activity Detector interrupt */
    .long   Reserved46_IRQHandler  /* Reserved interrupt */
    .long   RNG_IRQHandler  /* Random Number Generator interrupt */
    .long   RTC_IRQHandler  /* Real Time Clock Alarm interrupt OR Wakeup timer interrupt */
    .long   Reserved49_IRQHandler  /* xxx Interrupt 49 */
    .long   MU_A_IRQHandler  /* Messaging Unit - Side A */
    .long   PIN_INT4_IRQHandler  /* General Purpose Input/Output interrupt 4 */
    .long   PIN_INT5_IRQHandler  /* General Purpose Input/Output interrupt 5 */
    .long   PIN_INT6_IRQHandler  /* General Purpose Input/Output interrupt 6 */
    .long   PIN_INT7_IRQHandler  /* General Purpose Input/Output interrupt 7 */
    .long   CTIMER2_IRQHandler  /* Standard counter/timer CTIMER2 */
    .long   CTIMER4_IRQHandler  /* Standard counter/timer CTIMER4 */
    .long   OS_EVENT_IRQHandler  /* Event timer M33 Wakeup/interrupt */
    .long   FLEXSPI0_FLEXSPI1_IRQHandler  /* FlexSPI0_IRQ OR FlexSPI1_IRQ */
    .long   FLEXCOMM6_IRQHandler  /* FlexComm interrupt */
    .long   FLEXCOMM7_IRQHandler  /* FlexComm interrupt */
    .long   USDHC0_IRQHandler  /* USDHC interrupt */
    .long   USDHC1_IRQHandler  /* USDHC interrupt */
    .long   SGPIO_INTA_IRQHandler  /* Secure GPIO HS interrupt 0 */
    .long   SGPIO_INTB_IRQHandler  /* Secure GPIO HS interrupt 1 */
    .long   I3C0_IRQHandler  /* Improved Inter Integrated Circuit 0 interrupt */
    .long   USB0_IRQHandler  /* USB device */
    .long   USB0_NEEDCLK_IRQHandler  /* USB Activity Wake-up Interrupt */
    .long   WDT1_IRQHandler  /* Watchdog timer 1 interrupt */
    .long   USB_PHYDCD_IRQHandler  /* USBPHY DCD interrupt */
    .long   DMA1_IRQHandler  /* DMA interrupt */
    .long   PUF_IRQHandler  /* QuidKey interrupt */
    .long   POWERQUAD_IRQHandler  /* Powerquad interrupt */
    .long   CASPER_IRQHandler  /* Caspar interrupt */
    .long   PMU_PMIC_IRQHandler  /* Power Management Control interrupt */
    .long   HASHCRYPT_IRQHandler  /* SHA interrupt */
    .long   FLEXCOMM8_IRQHandler  /* FlexComm interrupt */
    .long   FLEXCOMM9_IRQHandler  /* FlexComm interrupt */
    .long   FLEXCOMM10_IRQHandler  /* FlexComm interrupt */
    .long   FLEXCOMM11_IRQHandler  /* FlexComm interrupt */
    .long   FLEXCOMM12_IRQHandler  /* FlexComm interrupt */
    .long   FLEXCOMM13_IRQHandler  /* FlexComm interrupt */
    .long   FLEXCOMM16_IRQHandler  /* FlexComm interrupt */
    .long   I3C1_IRQHandler  /* Improved Inter Integrated Circuit 1 interrupt */
    .long   FLEXIO_IRQHandler  /* Flexible I/O interrupt */
    .long   LCDIF_IRQHandler  /* Liquid Crystal Display interface interrupt */
    .long   GPU_IRQHandler  /* Graphics Processor Unit interrupt */
    .long   MIPI_IRQHandler  /* MIPI interrupt */
    .long   Reserved88_IRQHandler  /*  */
    .long   SDMA_IRQHandler  /* Smart DMA Engine Controller interrupt */

    .size    __isr_vector, . - __isr_vector

    .text
    .thumb

/* Reset Handler */
    .thumb_func
    .align 2
    .globl   Reset_Handler
    .weak    Reset_Handler
    .type    Reset_Handler, %function
Reset_Handler:
    cpsid   i               /* Mask interrupts */
    .equ    VTOR, 0xE000ED08
    ldr     r0, =VTOR
    ldr     r1, =__isr_vector
    str     r1, [r0]
    ldr     r2, [r1]
    msr     msp, r2
    ldr     r0, =__StackLimit
    msr     msplim, r0
#ifndef __NO_SYSTEM_INIT
    ldr   r0,=SystemInit
    blx   r0
#endif
/*     Loop to copy data from read only memory to RAM. The ranges
 *      of copy from/to are specified by following symbols evaluated in
 *      linker script.
 *      __etext: End of code section, i.e., begin of data sections to copy from.
 *      __data_start__/__data_end__: RAM address range that data should be
 *      copied to. Both must be aligned to 4 bytes boundary.  */

